"""Как мы помним, в Python нет таких вещей как null и true, поэтому попытка просто считать
этот файл и присвоить его как словарь провалится. Значит, нужно поменять null на None и true на True.
Это как раз один из значимых моментов необходимости модуля JSON.

Шаги простые (см. на рис. 15.3.2.):

Импортируем модуль JSON.
Открываем файл на чтение (не забываем прописать encoding, так как в файле имеются русские буквы).
Присваиваем переменной результат работы метода load() из модуля JSON.
Результат — это словарь, с которым мы уже умеем работать (если забыли, возвращаемся в урок 12.5)."""



import json

with open('C:/Users/drolya/PycharmProjects/15.3_readFile/json_example.json', encoding='utf8') as f:
    templates = json.load(f)

print(templates)
print(type(templates))
