# Нам необходимо рассчитать площадь геометрической фигуры на основе полиморфизма:

# Итак, у нас есть класс Rectangle с двумя параметрами: ширина и высота (a и b). Мы можем найти площадь прямоугольника. Для этого нужно длину умножить на высоту (строка кода 6).
# Для решения используем специальный метод get_area. Он принимает аргумент self, то есть сам класс Rectangle, и возвращает произведение атрибута a (ширина) на b (высота).

# Выполните задание, взяв за основу полученный код из задания 16.8.1. Добавьте еще один класс — круг (class Circle), который принимает в качестве аргументов свой радиус.

# clВычислите площадь круга (вспомните формулу).

class Rechtangle:
    def __init__(self, a, b):
        self.a = a
        self.b = b
    def get_area(self):
        return self.a * self.b

# возведение в степень 2 или квадрат
class Square:
    def __init__(self, a):
        self.a = a
    def get_area_square(self):
        return self.a ** 2

# Вычислите площадь круга
class Circle:
    def __init__(self, r):
        self.r = r
    def get_area_circle(self):
        return (self.r ** 2) * 3.14
